### Методы списков

| `list.append(v)`     | `list.insert(i, v)` |
| -------------------- | ------------------- |
| `list.remove(v)`     | `= list.index(v)`   |
| `list.clear()`       | `= list.count(v)`   |
| `list.extend(list1)` | `= list.pop(i)`     |
| `list.copy()`        | `del list[i]`       |
| `list.sort()`        | `list.reverse()`    |

---

### Метод списка `append()`
Добавляет один элемент в конец списка. 
```python
arr.append(value) -> None
```
- `arr` — исходный список, куда добавляем
- `value` — добавляемый элемент
```python
arr = [1, 2, 3, 5, 8, 13]
arr.append(21)
# arr = arr + [21]  # или так
# arr += [21]  # или так
print(arr) # [1, 2, 3, 5, 8, 13, 21]
```

---

#### Задача 0
Напишите программу, которая получает на вход список слов и возвращает список из первых букв каждого слова.
```
Слова: ток орел работа тепло
```
```
['т', 'о', 'р', 'т']
```
`for` `append` `split`

---

### Метод списка `insert()`
Добавляет один элемент по указанному индексу.
```python
arr.insert(index, value) -> None
```
- `arr` — исходный список, куда добавляем
- `index` — индекс куда вставляем элемент
- `value` — добавляемый элемент
```python
arr = [1, 2, 3, 5, 8, 13]
arr.insert(2, 789)
print(arr) # [1, 2, 789, 3, 5, 8, 13]
```

---

#### Задача 1
Напишите программу, которая создает список:
```python
my_list = ["один", "два", "четыре", "пять"]
```
Добавьте слово `"три"` на свое порядковое место в списке.
Выведите получившийся список.

---

### Метод списка `extend()`
Расширяет список, добавляя в конец все элементы другого списка
```python
arr.extend(iterable) -> None
```
- `arr` — исходный список, куда добавляем
- `iterable` — добавляемая последовательность
```python
arr = [1, 2, 3, 5]
x = [8, 13, 21]
arr.extend(x) # arr += х  или так
print(arr) # [1, 2, 3, 5, 8, 13, 21]
```

---

### Метод списка `remove()`
Удаляет первый элемент в списке, имеющий указанное значение.
```python
arr.remove(value) -> None
```
- `arr` — исходный список, откуда удаляем
- `value` — удаляемое значение
```python
arr = [1, 2, 3, 5, 8, 3, 13]
arr.remove(3)
print(arr) # [1, 2, 5, 8, 3, 13]
```
- `ValueError`, если такого элемента нет.

---

Как быть с исключением `ValueError` метода `remove()`
```python
arr = [1, 2, 3, 5, 8, 13]
x = 3
if x in arr:  # есть ли элемент?
	arr.remove(x)
```
Или перебирать в цикле
```python
arr = [1, 2, 3, 5, 8, 13]
for i in arr:
	if i % 2 == 0:
		arr.remove(i)
```

---

#### Задача 2
Напишите программу, которая из предложенного списка целых чисел 
```python
my_list = [10, -5, 8, -3, 0, -7, 2]
```
удаляет все отрицательные числа, используя метод `remove()`. Выведите полученный список на экран.
```
[10, 8, 0, 2]
```

---

### Метод списков и кортежей `index()`
Возвращает индекс первого элемента с указанным значением.
```python
arr.index(value, start:int=0, end:int=-1) -> int
```
- `arr` — исходный список
- `value` — искомое значение
- `start` (необязательно) – начать поиск с этого индекса
- `end` (необязательно) – искать элемент до этого индекса

---

```python
arr = (1, 2, 3, 5, 8, 13)
index = arr.index(5)
print(index)  # 3
```
- `ValueError`, если такого элемента нет.

---

Как быть с исключением  `ValueError`  
метода `index()`
```python
arr = [1, 2, 3, 5, 8, 13]
x = 3
# проверяем есть ли элемент
if x in arr:
	index = arr.index(x)
```

---

### Метод списка `pop()`
Удаляет элемент по индексу и возвращает его. Если индекс не указан, удаляется последний элемент.
```python
arr.pop(index|None) -> value
```
- `arr` — изменяемый список
- `index` — индекс удаляемого элемента
```python
arr = [1, 2, 3, 5, 8, 13]
kill_item = arr.pop(4)
print(kill_item)  # 8
print(arr) # [1, 2, 3, 5, 13]
```
- `IndexError`, если индекс вне диапазона списка.

---

Как быть с исключением `IndexError`  
метода `pop()`

Проверяем что индекс находится в диапазоне $- \textnormal{len(arr)} \leqslant  \textnormal{ind} <  \textnormal{len(arr)}$, для отрицательных и положительных индексов.
```python
arr = [1, 2, 3, 5, 8, 13]
ind = 4

if -len(arr) <= ind < len(arr):
	kill_item = arr.pop(ind)
```

---

Как быть с исключением `IndexError`  
метода `pop()`

Либо используем индекс в пределах цикла,  
тогда не выйдем за пределы массива.
```python
arr = [1, 2, 3, 5, 8, 13]

for i in range(len(arr)):
	if i % 2 == 0:
		kill_item = arr.pop(i)
```

---

### Оператор `del`
Удаляет указанный за ним объект.
```python
arr = [1, 2, 3, 5, 8, 13, 21]
# удаляем первый элемент
del arr[0]
# [2, 3, 5, 8, 13, 21]
```
```python
arr = [1, 2, 3, 5, 8, 13, 21]
# удаляем все начиная с 4-го
del arr[3:]
# [1, 2, 3]
```

---

### Метод списка `clear()`
Очищает список.
```python
arr.clear() -> None
```
- `arr` — изменяемый список
```python
arr = [1, 2, 3, 5, 8, 13, 21]
arr.clear()
# arr = []  # или так
print(arr)  # []
```

---

### Метод списков и кортежей `count()`
Возвращает количество элементов с указанным значением 
```python
arr.count(value) -> int
```
- `arr` — исходный список
- `value` — искомые значения
```python
arr = (1, 2, 3, 5, 2, 3, 1, 2)
x = 2
num_of_count = arr.count(x)
print(num_of_count)  # 3
```

---

### Метод списка `copy()`
Возвращает копию списка.  
Новый экземпляр, а не ссылку.
```python
arr.copy() -> list
```
- `arr` — копируемый список
```python
arr = [1, 2, 3, 5]
copy_arr = arr.copy()
# copy_arr = arr[:]  # или так
print(copy_arr) # [1, 2, 3, 5]
```

---

### Метод списка `sort()`
Сортирует список. 
```python
arr.sort(reverse:bool=False) -> None
```
- `arr` — сортируемый список
- `reverse=` — аргумент позволяющий изменить порядок сортировки, по умолчанию `False`

Список из чисел сортирует по порядку.
```python
arr = [1, 2, 3, 5, 2, 3, 1, 2]
arr.sort()
print(arr) # [1, 1, 2, 2, 2, 3, 3, 5]
```

---

#### Метод списка `sort()`
Текстовый список сортирует по алфавиту (точнее по индексу первой буквы в таблице кодировки).
```python
arr = ["dog", "lama", "cat"]
arr.sort()

print(arr) # ['cat', 'dog', 'lama']
```

---

#### Метод списка `sort()`
Сортировка в обратную строну
```python
arr = [1, 2, 3, 5, 2, 3, 1, 2]
arr.sort(reverse=True)

print(arr)
# [5, 3, 3, 2, 2, 2, 1, 1]
```

---

### Метод списка `reverse()`
Разворачивает список задом-наперед.
```python
arr.reverse() -> None
```
- `arr` — изменяемый список
```python
arr = [1, 2, 3, 5, 8]
arr.reverse()

print(arr)  # [8, 5, 3, 2, 1]
```

---

### Разворот последовательности с помощью срезов
Срез возвращающий развернутый упорядоченную последовательность (`str`, `list`, `tuple`), или диапазон `range`.
```python
arr = (1, 2, 3, 5, 8)
new_arr = arr[::-1]

print(new_arr)  # (8