Задание 1

В переменной `s` хранится строка пар `число:слово`. Дополните приведенный код, используя генератор, чтобы получить словарь `result` , в котором числа будут ключами, а слова – значениями.

**Примечание 1.** Ключи словаря должны быть целыми числами (иметь тип `int`), значения – строками (иметь тип `str`).

Ваше решение:

```python
s = '1:men 2:kind 90:number 0:sun 34:book 56:mountain 87:wood 54:car 3:island 88:power 7:box 17:star 101:ice'.split(':')
result = {}

for i in range(0, len(s), 2):
    result[s[i]] = s[i + 1]

print(result)
('!Смог только так!')
```

---

Задание 2

Дополните приведенный код, используя генератор, так, чтобы получить словарь `result` , в котором ключом будет строка – элемент списка `words`, а значением – список соответствующих кодов ASCII символов данной строки.

**Примечание 1.** Если бы список `words` имел вид: `words = ['yes', 'hello']`, то результатом был бы словарь

```python
result = {'yes': [121, 101, 115], 'hello': [104, 101, 108, 108, 111]}
```

**Примечание 2.** Для получения ASCII кода символа используйте функцию `ord()`.

Ваше решение:

```python
words = ['hello', 'bye', 'yes', 'no', 'python', 'apple', 'maybe', 'stepik', 'beegeek']

result = {key: [ord(i) for i in key] for key in words}
print(result)
```

---

Задание 3

Напишите программу, которая сохраняет только тех пассажиров в список, которые пришли на рейс вовремя (True - пришел вовремя, False - опоздал на рейс)

```python
my_dict = {'Mike': True, 'Lenny': False, 'Kappa': True}
print(my_dict)
result = []

for key, value in my_dict.items():
    if value:
        result.append(key)

print(result)
```
---

Задание 4

Напишите программу, которая выводит средний возраст пассажиров:

```python
my_dict = {'Mike': 11, 'Lenny': 17, 'Kappa': 44}
res = 0

for i in my_dict.values():
    res += i
result = i / len(my_dict)
print(result)
```

---

Задание 5

Список `tuples` содержит кортежи, состоящие из трех чисел.

Дополните приведенный код, используя генератор, чтобы получить словарь `result`, в котором ключом является первый элемент каждого кортежа, а значением – кортеж из оставшихся двух элементов.



```python
tuples = [(1, 2, 3), (4, 5, 6), (7, 8, 9), (10, 11, 12), (13, 14, 15), (16, 17, 18), (19, 20, 21), (22, 23, 24), (25, 26, 27), (28, 29, 30), (31, 32, 33), (34, 35, 36)]

result = {value[0]: value[1:] for value in tuples}
print(result)


```



---


