Списки самостоятельная



Напишите программу, которая принимает список чисел и выводит на экран сумму первых трех элементов списка.



```python
#ваш код сюда

nuers = input('Введте чсла через пробел: ').split(' ')
print(int(nuers[0]) + int(nuers[1]) + int(nuers[2]))
```



---

Напишите программу, которая принимает список строк, удаляет все элементы, которые начинаются на букву 'a'.

```python
#ваш код сюда

a = input('Введите слова через пробел: ').split(' ')
for i in a:
    str(i)
    print(i)
    if i[0] == 'a':
        a.remove(i)
print(a)

```



---

Напишите программу, которая принимает список чисел и выводит в столбик на экран все элементы списка, кроме первого и последнего.

```python
#ваш код сюда

numers = input('Введите цифры через пробел: ').split(' ')
del numers[0]
del numers[-1]
for i in numers:
    print(str(i) + '\n')
```



---

Напишите программу, которая запрашивает у пользователя список слов, затем выводит на экран все слова в обратном порядке.



```python
#ваш код сюда

a = input('Введите слова через пробел: ')
print(a[::-1])
```



---

Напишите программу, которая создает список из пяти чисел, сортирует его в порядке убывания и выводит на экран.



```python
#ваш код сюда

numbers = [5, 2, 9, 1, 7]
numbers.sort()
print(numbers)
```



---

Напишите программу, которая создает список из слов "apple", "banana", "cherry", "date" и "elderberry", затем запрашивает у пользователя индекс элемента и выводит его на экран. Если индекс находится за пределами диапазона списка, программа должна сообщить об этом.

```python
#ваш код сюда

```
